public/blog/pinebook-pro/pinebook-pro-use-nvme-as-root/index.html
<!DOCTYPE html>
<html lang="en">
<head>  <meta charset="UTF-8">
  <meta name="viewport" content="width=device-width, initial-scale=1">
  <link rel="stylesheet" href="/css/gtd.css">
  <link rel="icon" href="/favicon.ico" type="image/x-icon"/>
  
  
</head>
<body>
  
<main>
  <div style="margin: 1rem;">
    <a href="/" style="
      display: inline-block;
      background-color: #eee;
      color: #333;
      padding: 0.4rem 0.8rem;
      border-radius: 6px;
      text-decoration: none;
      font-weight: bold;
      font-family: sans-serif;
      font-size: 0.9rem;
    ">
      ← Homepage
    </a>

  <title>blog/Pinebook Pro Use Nvme as Root</title>
  <h1>Pinebook Pro Use Nvme as Root</h1>

  </div>
  <nav class="toc">
    <nav id="TableOfContents">
<ul>
<li><a href="#headline-1">Pinebook Pro Use Nvme as Root</a>
<ul>
<li><a href="#headline-2">Preamble</a>
</li>
</ul>
</li>
<li><a href="#headline-3">Moving root partitions</a>
<ul>
<li><a href="#headline-4">Assumptions</a>
</li>
<li><a href="#headline-5">Mounting the system</a>
</li>
<li><a href="#headline-6">Copying root files</a>
</li>
<li><a href="#headline-7">Changing the root to nvme</a>
<ul>
<li><a href="#headline-8">Fix for read only boot partition error</a>
</li>
</ul>
</li>
</ul>
</li>
</ul>
</nav>
  </nav> 

  <article>
    
<div id="outline-container-headline-1" class="outline-2">
<h2 id="headline-1">
Pinebook Pro Use Nvme as Root
</h2>
<div id="outline-text-headline-1" class="outline-text-2">
<div id="outline-container-headline-2" class="outline-3">
<h3 id="headline-2">
Preamble
</h3>
<div id="outline-text-headline-2" class="outline-text-3">
<p>Directions on using the Pinebook Pro&#39;s NVME as a root partition and the EMMC as</p>
</div>
</div>
</div>
</div>
<div id="outline-container-headline-3" class="outline-2">
<h2 id="headline-3">
Moving root partitions
</h2>
<div id="outline-text-headline-3" class="outline-text-2">
<div id="outline-container-headline-4" class="outline-3">
<h3 id="headline-4">
Assumptions
</h3>
<div id="outline-text-headline-4" class="outline-text-3">
<ul>
<li>You have an NVME drive installed and formatted with a single EXT4 partition</li>
<li>Running Manjaro Arm or ALARM. Untested, though Debian may work the same as
well. This process relies on the existence of <code>/boot/extlinux/extlinux.conf</code></li>
</ul>
</div>
</div>
<div id="outline-container-headline-5" class="outline-3">
<h3 id="headline-5">
Mounting the system
</h3>
<div id="outline-text-headline-5" class="outline-text-3">
<div class="src src-shell">
<div class="highlight"><pre tabindex="0" style="color:#f8f8f2;background-color:#272822;-moz-tab-size:4;-o-tab-size:4;tab-size:4;"><code class="language-shell" data-lang="shell"><span style="display:flex;"><span>mount /dev/nvme0n1p1 /mnt
</span></span><span style="display:flex;"><span>cd /mnt
</span></span><span style="display:flex;"><span>mkdir dev sys proc mnt</span></span></code></pre></div>
</div>
</div>
</div>
<div id="outline-container-headline-6" class="outline-3">
<h3 id="headline-6">
Copying root files
</h3>
<div id="outline-text-headline-6" class="outline-text-3">
<p>
Use rsync to transfer the files. This excludes pseudo file systems.</p>
<div class="src src-shell">
<div class="highlight"><pre tabindex="0" style="color:#f8f8f2;background-color:#272822;-moz-tab-size:4;-o-tab-size:4;tab-size:4;"><code class="language-shell" data-lang="shell"><span style="display:flex;"><span>rsync -aHxv --numeric-ids --progress /* /mnt --exclude<span style="color:#f92672">=</span>/dev --exclude<span style="color:#f92672">=</span>/proc --exclude<span style="color:#f92672">=</span>/sys --exclude<span style="color:#f92672">=</span>/mnt</span></span></code></pre></div>
</div>
</div>
</div>
<div id="outline-container-headline-7" class="outline-3">
<h3 id="headline-7">
Changing the root to nvme
</h3>
<div id="outline-text-headline-7" class="outline-text-3">
<p>
Rename the boot folder which was copied to the NVME. This isn&#39;t needed. Edit
your extlinux.conf file on the EMMC, then change the setting for the root
partition path.</p>
<div class="src src-shell">
<div class="highlight"><pre tabindex="0" style="color:#f8f8f2;background-color:#272822;-moz-tab-size:4;-o-tab-size:4;tab-size:4;"><code class="language-shell" data-lang="shell"><span style="display:flex;"><span>$ mv /mnt/boot /mnt/boot.old
</span></span><span style="display:flex;"><span>$ vim /boot/extlinux/extlinux.conf
</span></span><span style="display:flex;"><span>
</span></span><span style="display:flex;"><span><span style="color:#75715e"># Change &#34;root=LABEL=ROOT&#34; to &#34;root=/dev/nvme0n1p1&#34;</span></span></span></code></pre></div>
</div>
<div id="outline-container-headline-8" class="outline-4">
<h4 id="headline-8">
Fix for read only boot partition error
</h4>
<div id="outline-text-headline-8" class="outline-text-4">
<p>If the boot partition is &#34;read only&#34;, you can remount it with rw
permissions as so:</p>
<div class="src src-shell">
<div class="highlight"><pre tabindex="0" style="color:#f8f8f2;background-color:#272822;-moz-tab-size:4;-o-tab-size:4;tab-size:4;"><code class="language-shell" data-lang="shell"><span style="display:flex;"><span>$ mount /dev/mmcblk1p1 /boot -o remount,rw</span></span></code></pre></div>
</div>
</div>
</div>
</div>
</div>
</div>
</div>

  </article>
</main>

</body>
</html>
